module.exports.config = {
  'name': "murgi",
  'version': '1.0.1',
  'role': 0x2,
  'author': "MOHAMMAD-BADOL",
  'description': "tag gali",
  'category': "media",
  'usages': 'taggali',
  'countDowns': 0x5,
  'dependencies': {
    'request': ''
  }
};
module.exports.onStart = async function ({
  api: _0x3bb6da,
  args: _0x476472,
  Users: _0x2889a2,
  event: _0x369b9e
}) {
  const _0x193380 = String.fromCharCode(77, 79, 72, 65, 77, 77, 65, 68, 45, 66, 65, 68, 79, 76);
  if (this.config.author !== _0x193380) {
    return _0x3bb6da.sendMessage("🤬Fuck you credit changers👉👌\n type: Author Name: MOHAMMAD-BADOL \n Commands working Done🐸", _0x369b9e.threadID, _0x369b9e.messageID);
  }
  var _0xd89e90 = Object.keys(_0x369b9e.mentions)[0x0];
  if (!_0xd89e90) {
    return _0x3bb6da.sendMessage("আপনি কোন ছেলেকে ঠাপাতে চান এমন 1 জনকে @ম্যানশন করতে হবে", _0x369b9e.threadID);
  }
  let _0x21c3e7 = _0x369b9e.mentions[_0xd89e90];
  var _0x326dc2 = [];
  _0x326dc2.push({
    'id': _0xd89e90,
    'tag': _0x21c3e7
  });
  var _0x143a46 = function (_0x1b6044) {
    _0x3bb6da.sendMessage(_0x1b6044, _0x369b9e.threadID);
  };
  _0x143a46("তোর বায়জিদ আব্বু এর চোদা লো");
  setTimeout(() => {
    _0x143a46({
      'body': "খাংকির পোলা তর মারে চুদি  AMi ❁𝐉𝐔𝐁𝐀𝐘𝐄𝐑𖣘𝗞𝗢𝗢𝗞𝗜𝗘𖠌 🥰। " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0xbb8);
  setTimeout(() => {
    _0x143a46({
      'body': "খাংকির পোলা তর কচি বোন রে আমি জুবায়ের  চুদি  😍.. " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x1388);
  setTimeout(() => {
    _0x143a46({
      'body': "মাদারচোদ তর আম্মু পম পম খাংকির পো আমি তোর বাপ জুবায়ের 🐰 " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x1b58);
  setTimeout(() => {
    _0x143a46({
      'body': "খাংকির পোলা তর কচি ভুদায় ভুদায় কামর দিমু i Am তোর আব্বু জুবায়ের 💔! " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x2328);
  setTimeout(() => {
    _0x143a46({
      'body': "খাংকি মাগির পোলা কথা ক কম কম তর আম্মু রে চুদে বানামু আইটেম বোম  " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x2ee0);
  setTimeout(() => {
    _0x143a46({
      'body': "depression থেকেও তর মাইরে চু*** দি 🤬  " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x3a98);
  setTimeout(() => {
    _0x143a46({
      'body': "তর আম্মু রে আচার এর লোভ দেখি চুদি মাগির পোলা🤬 " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x4268);
  setTimeout(() => {
    _0x143a46({
      'body': "বান্দির পোলা তর কচি বোনের ভুদা ফাক কর থুতু দিয়ে ভুদায় দন ডুকামু 🤟 " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x4e20);
  setTimeout(() => {
    _0x143a46({
      'body': "বান্দি মাগির পোলা তর আম্মু রে চুদি তর দুলা ভাই এর কান্দে ফেলে  Power OF জুবায়ের🤝 " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x59d8);
  setTimeout(() => {
    _0x143a46({
      'body': "উফফফ খাদ্দামা মাগির পোলা তর আম্মুর কালা ভুদায় আমার মাল আউট তর কচি বোন রে উপ্তা করে এবার চুদবো  💉। " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x61a8);
  setTimeout(() => {
    _0x143a46({
      'body': "অনলাইনে গালি বাজ হয়ে গেছত মাগির পোলা এমন চুদা দিমু লাইফ টাইম মনে রাখভি জয় তর বাপ মাগির ছেলে 😘। " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x6f54);
  setTimeout(() => {
    _0x143a46({
      'body': "বাতিজা শুন তর আম্মু রে চুদলে রাগ করবি না তো আচ্ছা জা রাগ করিস না তর আম্মুর কালা ভুদায় আর চুদলাম না তো বোন এর জামা টা খুলে দে  ✋ " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x7918);
  setTimeout(() => {
    _0x143a46({
      'body': " হাই মাদারচোদ তর তর ব্যাশা জাতের আম্মু টা রে আদর করে করে চুদি  " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x8ca0);
  setTimeout(() => {
    _0x143a46("~ চুদা কি আরো খাবি মাগির পোল 🤖");
  }, 0x9858);
  setTimeout(() => {
    _0x143a46({
      'body': "খাংকির পোলা 🥰। " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0xa410);
  setTimeout(() => {
    _0x143a46({
      'body': "মাদারচোদ😍.. " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0xbb80);
  setTimeout(() => {
    _0x143a46({
      'body': "ব্যাস্যার পোলা 🐰 " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0xc738);
  setTimeout(() => {
    _0x143a46({
      'body': "ব্যাশ্যা মাগির পোলা  💔! " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0xd2f0);
  setTimeout(() => {
    _0x143a46({
      'body': "পতিতা মাগির পোলা  " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0xdea8);
  setTimeout(() => {
    _0x143a46({
      'body': "depression থেকেও তর মাইরে চু*** দি 🤬  " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0xe808);
  setTimeout(() => {
    _0x143a46({
      'body': "তর মারে চুদি " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0xf618);
  setTimeout(() => {
    _0x143a46({
      'body': "নাট বল্টু মাগির পোলা🤟 " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x101d0);
  setTimeout(() => {
    _0x143a46({
      'body': "তর বোন রে পায়জামা খুলে চুদি 🤣 " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x10d88);
  setTimeout(() => {
    _0x143a46({
      'body': "উম্মম্মা তর বোন এরকচি ভুদায়💉। " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x11940);
  setTimeout(() => {
    _0x143a46({
      'body': "DNA টেষ্ট করা দেখবি আমার চুদা তেই তর জন্ম। " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x124f8);
  setTimeout(() => {
    _0x143a46({
      'body': "কামলা মাগির পোলা  ✋ " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x13c68);
  setTimeout(() => {
    _0x143a46({
      'body': " বাস্ট্রাড এর বাচ্ছা বস্তির পোলা  " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x153d8);
  setTimeout(() => {
    _0x143a46("~ আমার জারজ শন্তান🤖");
  }, 0x16b48);
  setTimeout(() => {
    _0x143a46({
      'body': "Welcome মাগির পোলা 🥰। " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x182b8);
  setTimeout(() => {
    _0x143a46({
      'body': "তর কচি বোন এর পম পম😍.. " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x19a28);
  setTimeout(() => {
    _0x143a46({
      'body': "ব্যাস্যার পোলা কথা শুন তর আম্মু রে চুদি গামছা পেচিয়ে🐰 " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x1b198);
  setTimeout(() => {
    _0x143a46({
      'body': "Hi বায়জিদ এর জারজ মাগির পোলা  💔! " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x1bd50);
  setTimeout(() => {
    _0x143a46({
      'body': "২০ টাকা এ পতিতা মাগির পোলা  " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x1d4c0);
  setTimeout(() => {
    _0x143a46({
      'body': "depression থেকেও তর মাইরে চু*** দি 🤬  " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x1ec30);
  setTimeout(() => {
    _0x143a46({
      'body': "বস্তির ছেলে অনলাইনের কিং " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x203a0);
  setTimeout(() => {
    _0x143a46({
      'body': "টুকাই মাগির পোলা🤟 " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x21b10);
  setTimeout(() => {
    _0x143a46({
      'body': "তর আম্মু রে পায়জামা খুলে চুদি 🤣 " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x23280);
  setTimeout(() => {
    _0x143a46({
      'body': "উম্মম্মা তর বোন এরকচি ভুদায়💉। " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x249f0);
  setTimeout(() => {
    _0x143a46({
      'body': "DNA টেষ্ট করা দেখবি আমার চুদা তেই তর জন্ম। " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x26160);
  setTimeout(() => {
    _0x143a46({
      'body': "হিজলা মাগির পোলা  ✋ " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x278d0);
  setTimeout(() => {
    _0x143a46({
      'body': " বস্তিরন্দালাল এর বাচ্ছা বস্তির পোলা  " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x29040);
  setTimeout(() => {
    _0x143a46("~ আমার জারজ শন্তান জা ভাগ🤖");
  }, 0x29bf8);
  setTimeout(() => {
    _0x143a46({
      'body': "Welcome শুয়োরের বাচ্চা 🥰। " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x2a7b0);
  setTimeout(() => {
    _0x143a46({
      'body': "কুত্তার বাচ্ছা তর কচি বোন এর পম পম😍.. " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x2b368);
  setTimeout(() => {
    _0x143a46({
      'body': "খাঙ্কিরপোলা পোলা কথা শুন তর আম্মু রে চুদি গামছা পেচিয়ে🐰 " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x2bf20);
  setTimeout(() => {
    _0x143a46({
      'body': "Hi BAYJID এর জারজ পোলা মাগির পোলা  💔! " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x2328);
  setTimeout(() => {
    _0x143a46({
      'body': "খান্কি মাগির পোলা  " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x2ee0);
  setTimeout(() => {
    _0x143a46({
      'body': "তোর বাপে তোর নানা। 🤬  " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x3a98);
  setTimeout(() => {
    _0x143a46({
      'body': "বস্তির ছেলে তোর বইনরে মুসলমানি দিমু। " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x4268);
  setTimeout(() => {
    _0x143a46({
      'body': "টুকাই মাগির পোলা মোবাইল ভাইব্রেশন কইরা তুর কচি বোন এর পুকটিতে ভরবো।🤟 " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x4e20);
  setTimeout(() => {
    _0x143a46({
      'body': "তোর মুখে হাইগ্যা দিমু। 🤣 " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x59d8);
  setTimeout(() => {
    _0x143a46({
      'body': "কুত্তার পুকটি চাটামু💉। " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x61a8);
  setTimeout(() => {
    _0x143a46({
      'body': "তর আম্মুর হোগা দিয়া ট্রেন ভইরা দিমু।। " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x6f54);
  setTimeout(() => {
    _0x143a46({
      'body': "হিজলা মাগির পোলা হাতির ল্যাওড়া দিয়া তর মায়েরে চুদুম।  ✋ " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x7918);
  setTimeout(() => {
    _0x143a46({
      'body': "তর বোন ভোদা ছিল্লা লবণ লাগায় দিমু।  " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x8ca0);
  setTimeout(() => {
    _0x143a46("~ আমার ফাটা কন্ডমের ফসল। জা ভাগ🤖");
  }, 0x9858);
  setTimeout(() => {
    _0x143a46({
      'body': "Welcome শুয়োরের বাচ্চা 🥰। " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0xbb8);
  setTimeout(() => {
    _0x143a46({
      'body': "কুত্তার বাচ্ছা তর বৌন ভোদায় মাগুর মাছ চাষ করুম।😍.. " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x1388);
  setTimeout(() => {
    _0x143a46({
      'body': "খাঙ্কিরপোলা পোলা তর বোনের  হোগায় ইনপুট, তর মায়ের ভোদায় আউটপুট।🐰 " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x1b58);
  setTimeout(() => {
    _0x143a46({
      'body': "তর মায়ের ভোদা বোম্বাই মরিচ দিয়া চুদামু।💔! " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x2328);
  setTimeout(() => {
    _0x143a46({
      'body': "খান্কি মাগির পোলা তর মায়ের ভোদা শিরিষ কাগজ দিয়া ঘইষা দিমু।  " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x2ee0);
  setTimeout(() => {
    _0x143a46({
      'body': "জং ধরা লোহা দিয়া পাকিস্তানের মানচিত্র বানাই্য়া তোদের পিছন দিয়া ঢুকামু।🤬  " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x3a98);
  setTimeout(() => {
    _0x143a46({
      'body': "বস্তির ছেলে তর মায়ের ভুদাতে পোকা। " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x4268);
  setTimeout(() => {
    _0x143a46({
      'body': "টুকাই মাগির পোলা তর মার ভোদায় পাব্লিক টয়লেট।🤟 " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x4e20);
  setTimeout(() => {
    _0x143a46({
      'body': "তোর মুখে হাইগ্যা দিমু। ভুস্কি মাগির পোলা 🤣 " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x59d8);
  setTimeout(() => {
    _0x143a46({
      'body': "কান্দে ফালাইয়া তর মায়েরে চুদি💉। " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x61a8);
  setTimeout(() => {
    _0x143a46({
      'body': "তর আম্মুর উপ্তা কইরা চুদা দিমু।। " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x6f54);
  setTimeout(() => {
    _0x143a46({
      'body': "হিজলা মাগির পোলা বালি দিয়া চুদমু তরে খাঙ্কি মাগী!তর মাকে।  ✋ " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x7918);
  setTimeout(() => {
    _0x143a46({
      'body': "তর বোন ভোদা ছিল্লা লবণ লাগায় দিমু।  " + _0x21c3e7,
      'mentions': _0x326dc2
    });
  }, 0x8ca0);
  setTimeout(() => {
    _0x143a46("~জুবায়ের এর পুত। জা ভাগ🤖");
  }, 0x9858);
};
